{
  "results": {
    "0": {
      "title": "Construction Cost Index History - Engineering News-Record",
      "url": "https://www.enr.com/economics/historical_indices/construction_cost_annual_average",
      "content": "January 30, 2025 2025 Construction Forecast This webinar will address how forecasters see construction markets developing in 2025 as the industry faces the possibility of tariffs in addition to",
      "score": 0.64585793,
      "keywords": null
    },
    "1": {
      "title": "Construction Economics for January 13, 2025 | Engineering News-Record",
      "url": "https://www.enr.com/articles/60131-construction-economics-for-january-13-2025",
      "content": "facebook  twitter  linkedin instagram  youtube PROJECTS BUILDINGS NEWS BUSINESS CONTRACTOR BUSINESS STRATEGY ANNUAL PHOTO CONTEST PRODUCTS EQUIPMENT BUILDERS' RISK & INSURANCE EVENTS LA INFRASTRUCTURE FORUM NY/NJ INFRASTRUCTURE FORUM ENR BOOK STORE YEAR IN CONSTRUCTION PHOTO CONTEST Share This Story Post A Comment To This Article Comment* Subscription Center Renew Membership Manage My Preferences Popular Stories China Announces It Will Build Controversial 60GW Mega-Dam in Tibet United Rentals Acquires H&E Equipment Services for $4.8B Events Breaking Down Silos: How AI Empowers Better Collaboration Between General Contractors and Trade Partners Products SEE MORE PRODUCTS Related Articles Related Products SEE MORE PRODUCTS SEE MORE PRODUCTS The latest news and information SUBSCRIPTION CENTER Renew LinkedIn Facebook Instagram YouTube PRIVACY PRIVACY REQUEST UPDATE MY PREFERENCES",
      "score": 0.54521364,
      "keywords": null
    },
    "2": {
      "title": "January 20, 2025 | Engineering News-Record",
      "url": "https://www.enr.com/publications/11/editions/1544",
      "content": "facebook twitter linkedin instagram youtube ENR Top Lists ENR ENR reported that some federal border wall construction materials appeared on auction firm Ritchie Bros.’ government surplus website GovPlanet.com, and that many listings have already disappeared from the auction site. Information derived from Industrial Reports, a market intelligence firm specializing in industrial construction and equipment leads. Sponsored Content is a special paid section where industry companies provide high quality, objective, non-commercial content around topics of interest to the ENR audience. This webinar will address how forecasters see construction markets developing in 2025 as the industry faces the possibility of tariffs in addition to ongoing workforce challenges. ENR will call on two forecasters and a materials expert, asking them to share their views on the market prospects for the industry both nationally and regionally.",
      "score": 0.5195463,
      "keywords": null
    },
    "3": {
      "title": "2025 | Engineering News-Record",
      "url": "https://www.enr.com/topics/1066-2025",
      "content": "facebook twitter linkedin instagram youtube ENR Top Lists Best Project Award Contests Sponsored Content is a special paid section where industry companies provide high quality, objective, non-commercial content around topics of interest to the ENR audience. All Sponsored Content is supplied by the advertising company and any opinions expressed in this article are those of the author and not necessarily reflect the views of ENR or its parent company, BNP Media. This must-attend webinar will address how forecasters see construction markets developing in 2025 as the industry faces the possibility of tariffs in addition to ongoing workforce challenges. ENR will call on top forecasters, asking them to share their views on the market prospects for the industry both nationally and regionally.",
      "score": 0.5195463,
      "keywords": [
        "tariffs",
        " workforce challenges",
        " construction markets",
        " forecasters"
      ]
    },
    "4": {
      "title": "Construction Economics for January 20, 2025 | Engineering News-Record",
      "url": "https://www.enr.com/articles/60188-construction-economics-for-january-20-2025",
      "content": "facebook  twitter  linkedin instagram  youtube PROJECTS POWER & INDUSTRIAL NEWS PROJECT DELIVERY AWARDS REGIONAL CONTESTS AND SURVEYS PRODUCTS LISTS ENR TOP LISTS SURVEY SCHEDULE BUILDERS' RISK & INSURANCE CE CENTER YEAR IN CONSTRUCTION PHOTO CONTEST Share This Story Post A Comment To This Article Comment* Renew Membership Manage My Preferences Popular Stories China Announces It Will Build Controversial 60GW Mega-Dam in Tibet Port Authority Bus Terminal Replacement in NYC Gets $1.9B in Federal Funding How can you make AI work for your team? Sponsored by:  Sponsored by: Products SEE MORE PRODUCTS Related Articles Related Products SEE MORE PRODUCTS 2025 National Construction Estimator SEE MORE PRODUCTS Photo Submissions Renew Marketing Services List Rental Survey/Respondent Access LinkedIn Facebook Instagram YouTube PRIVACY UPDATE MY PREFERENCES",
      "score": 0.45159313,
      "keywords": null
    },
    "5": {
      "title": "The AI arms race is on for builders in 2025 | Construction Dive",
      "url": "https://www.constructiondive.com/news/ai-arms-race-builders-construction-2025/736685/",
      "content": "The AI arms race is on for builders in 2025 | Construction Dive Let Construction Dive's free newsletter keep you informed, straight from your inbox. “To our teammates, it will feel like StoaOne is talking to them, providing instant insights and project information as they procure, plan and execute their projects,” Bevans said in an email to Construction Dive. Jim Barrett, chief innovation officer for New York City-based Turner Construction, said that the company has at least tripled or quadrupled its investment in AI over the past couple years. “We also know that adopting new technologies and implementing them in our operations differentiates ourselves so we can significantly change the construction industry,” Bevans said. Subscribe to the Construction Dive free daily newsletter",
      "score": 0.5457947,
      "keywords": [
        "AI in construction",
        " technology adoption",
        " innovation in construction"
      ]
    },
    "6": {
      "title": "5 ways Trump could impact infrastructure construction in 2025",
      "url": "https://www.constructiondive.com/news/trump-impact-infrastructure-construction-2025/736597/",
      "content": "5 ways Trump could impact infrastructure construction in 2025 | Construction Dive A slew of changes are coming under the Trump administration for infrastructure builders working in the U.S. Despite anxiety around his tariff and mass deportation promises, the construction industry is optimistic about the return of a fellow builder to the Oval Office. Trump will likely focus funding on traditional infrastructure like roads and bridges, said Alex Etchen, vice president of government relations at Associated General Contractors of America. Public opinion is sometimes negative towards P3 projects and Trump once called them “more trouble than they’re worth.” However, he ran on reducing government spending, so they’re a funding tool he’s likely to use, according to Frank Banda, managing partner – Government and Public Sector Advisory at New York City-based accounting firm CohnReznick.",
      "score": 0.5009527,
      "keywords": [
        "infrastructure construction",
        " roads and bridges",
        " P3 projects",
        " government spending"
      ]
    },
    "7": {
      "title": "Fed trims main interest rate, signals prospect of less easing in 2025",
      "url": "https://www.constructiondive.com/news/fed-trims-main-interest-rate/736010/",
      "content": "Fed trims main interest rate, signals prospect of less easing in 2025 | Construction Dive Let Construction Dive's free newsletter keep you informed, straight from your inbox. In a median forecast, Fed officials estimated that they would reduce the main rate to 3.9% by the end of next year, a half percentage point higher than their September forecast. Pelles.ai Welcomes Jake Olsen, CEO of Stratus to Advisory Board From Pelles.ai January 20, 2025 Hannah Chancellor Steps into the CEO Role at Amundson Group, America's Fastest Growing Constru… From Amundson Group January 08, 2025 American Global Promotes Andrea Rusche to Vice President of Insurance for Texas Operations From American Global January 02, 2025 TMG Construction Corporation Announces Jason J.",
      "score": 0.48235655,
      "keywords": null
    },
    "8": {
      "title": "Contractors should brace for weaker conditions: AIA - Construction Dive",
      "url": "https://www.constructiondive.com/news/contractors-brace-weaker-conditions-aia-economy/705698/",
      "content": "Contractors should brace for weaker conditions: AIA | Construction Dive Let Construction Dive's free newsletter keep you informed, straight from your inbox. Construction Dive news delivered to your inbox By Construction Dive Staff • Jan. 7, 2025 Construction Dive news delivered to your inbox Pelles.ai Welcomes Jake Olsen, CEO of Stratus to Advisory Board From Pelles.ai January 20, 2025 KAST Construction Announces the Completion of Park and Main From KAST Construction January 14, 2025 Planera Surpasses 25 Million Days of Schedule Managed, Marking Rapid Growth in Visual Scheduli… From Planera January 08, 2025 TMG Construction Corporation Announces Jason J. By Construction Dive Staff • Jan. 7, 2025 By Construction Dive Staff Get Construction Dive in your inbox",
      "score": 0.44695392,
      "keywords": null
    },
    "9": {
      "title": "AI rush is fueling tech debt 'tsunami': Forrester | Construction Dive",
      "url": "https://www.constructiondive.com/news/tech-debt-tsunami-building-amid-ai-craze-forrester/734098/",
      "content": "AI rush is fueling tech debt ‘tsunami’: Forrester | Construction Dive Let Construction Dive's free newsletter keep you informed, straight from your inbox. Construction Dive has you covered with a full list of industry conferences and tech expos on tap for 2025. American Global Promotes Andrea Rusche to Vice President of Insurance for Texas Operations From American Global January 02, 2025 Houzz Improves Project Management for Large Construction and Design Firms with New Houzz Pro … From Houzz December 17, 2024 The Wounded Workforce Launches Groundbreaking 'Building Resilience- Construction Mental Health… From The Wounded Workforce December 17, 2024 TMG Construction Corporation Announces Jason J. Construction Dive has you covered with a full list of industry conferences and tech expos on tap for 2025.",
      "score": 0.44608507,
      "keywords": null
    }
  }
}
